In [124]:
import pandas as pd
import numpy as np
data = pd.read_csv('titanic_ch.csv',index_col='PassengerId')

In [125]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,3,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,5,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,5,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,9,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,11,0,0,373450,8.0500,NaN,S

In [126]:
snames = data['Name']
snames

PassengerId
1                              Braund, Mr. Owen Harris
2    Cumings, Mrs. John Bradley (Florence Briggs Th...
3                               Heikkinen, Miss. Laina
4         Futrelle, Mrs. Jacques Heath (Lily May Peel)
5                             Allen, Mr. William Henry
Name: Name, dtype: object

In [127]:
s = snames.str.split(' |\\(')
s

PassengerId
1                         [Braund,, Mr., Owen, Harris]
2    [Cumings,, Mrs., John, Bradley, , Florence, Br...
3                           [Heikkinen,, Miss., Laina]
4    [Futrelle,, Mrs., Jacques, Heath, , Lily, May,...
5                        [Allen,, Mr., William, Henry]
dtype: object

In [128]:
mas = []
for item in s:
    for asd in item:
        if (asd == ''):
            continue
        mas.append(asd)
print(mas)

['Braund,', 'Mr.', 'Owen', 'Harris', 'Cumings,', 'Mrs.', 'John', 'Bradley', 'Florence', 'Briggs', 'Thayer)', 'Heikkinen,', 'Miss.', 'Laina', 'Futrelle,', 'Mrs.', 'Jacques', 'Heath', 'Lily', 'May', 'Peel)', 'Allen,', 'Mr.', 'William', 'Henry']

In [129]:
con = pd.Series(mas)
con.value_counts()

Mr.           2
Mrs.          2
Harris        1
May           1
Peel)         1
Futrelle,     1
Henry         1
Owen          1
Lily          1
Braund,       1
Heath         1
Bradley       1
Miss.         1
Laina         1
William       1
Cumings,      1
Thayer)       1
Briggs        1
Heikkinen,    1
Allen,        1
Florence      1
Jacques       1
John          1
dtype: int64

In [130]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,3,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,5,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,5,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,9,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,11,0,0,373450,8.0500,NaN,S

In [131]:
test = data['Sex']
test

PassengerId
1      male
2    female
3    female
4    female
5      male
Name: Sex, dtype: object

In [133]:
data['Sex'] = data['Sex'].str.replace('male','1')

In [134]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",1,3,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",fe1,5,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",fe1,5,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",fe1,9,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",1,11,0,0,373450,8.0500,NaN,S

In [136]:
data['Sex'] = data['Sex'].str.replace('fe1','0')

In [138]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",1,3,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,5,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",0,5,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,9,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",1,11,0,0,373450,8.0500,NaN,S

In [141]:
data['Sex'] = data['Sex'].astype(int)

In [142]:
X = np.array(data)
X

array([[0, 3, 'Braund, Mr. Owen Harris', 1, 3, 1, 0, 'A/5 21171', 7.25,
        nan, 'S'],
       [1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 0, 5,
        1, 0, 'PC 17599', 71.2833, 'C85', 'C'],
       [1, 3, 'Heikkinen, Miss. Laina', 0, 5, 0, 0, 'STON/O2. 3101282',
        7.925, nan, 'S'],
       [1, 1, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 0, 9, 1, 0,
        '113803', 53.1, 'C123', 'S'],
       [0, 3, 'Allen, Mr. William Henry', 1, 11, 0, 0, '373450', 8.05, nan,
        'S']], dtype=object)